app/controllers/application_controller.rb

  def current_user
    User.find_by(id:session[:current_user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]