app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        items = Item.all

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        item = Item.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "Vintage Wooden dresser"], ["updated_at", "2022-05-01 18:06:11.227615"], ["id", 14]]
---
    def update
        item = Item.find(params[:id])
        item.update!(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]
---
    def destroy
        item = Item.find(params[:id])
        item.destroy